# Надрукуйте "Привіт, світ!" у консолі.
# Створіть змінні для зберігання вашого імені та віку, а потім надрукуйте їх.
# Виконайте базові арифметичні операції (додавання, віднімання, множення, ділення) та надрукуйте результати.
# Продемонструйте використання різних типів даних: рядок, ціле число, дрібне число та булевий тип.
# Порівняйте два числа та виведіть результат порівняння.
# Запитайте у користувача його вік і виведіть, скільки йому буде років через 5 років.
# Запишіть рядок у зворотному порядку та виведіть його.
# Виведіть всі парні числа від 1 до 20.
# Знайдіть залишок від ділення двох чисел без використання оператора залишку.
# Створіть константу зі значенням вашого улюбленого числа і виведіть її.