# Створіть список з п'яти фруктів та продемонструйте, як додавати, видаляти та доступати до елементів.
# Створіть кортеж з трьома значеннями та використовуйте розпаковку кортежу для присвоєння кожного значення окремій змінній.
# Створіть словник, який представляє телефонну книгу, відображайте імена на телефонні номери та продемонструйте, як доступати та модифікувати його елементи.
# Створіть набір чисел та продемонструйте базові операції над наборами: об'єднання, перетин, різниця.
# Використовуйте список для зберігання оцінок студента та обчисліть середній бал.
# Створіть словник, де ключами будуть імена студентів, а значеннями - їхні оцінки. Виведіть студентів з оцінкою вище за середнє.
# Використовуйте множину для видалення дублікатів зі списку.
# Створіть список списків, де кожен внутрішній список буде представляти рядок матриці. Виведіть матрицю.
# Використовуйте кортежі для зберігання інформації про книги (автор, назва, рік видання) і виведіть цю інформацію.
# Використовуйте список вкладених словників для зберігання інформації про кілька книг (кожна книга - окремий словник).