# Виведіть речення, використовуючи форматування рядків для включення змінних з іменем і віком.
# Продемонструйте використання щонайменше трьох методів рядків, наприклад, upper(), lower(), replace().
# Використовуйте спискове включення для створення списку квадратів чисел від 1 до 10.
# Напишіть програму, яка використовує вирази умов для класифікації числа як 'Парне' або 'Непарне'.
# Використовуйте рядкові методи для знаходження кількості голосних і приголосних у рядку.
# Реалізуйте програму, що перевіряє, чи є рядок паліндромом.
# Напишіть програму для об'єднання двох рядків через пробіл.
# Створіть програму, що використовує вираз if-elif-else для оцінювання рівня знань студента (A, B, C, D, F).
# Використовуйте цикл for для друкування кожного символу рядка у вертикальному порядку.
# Створіть програму, яка замінює всі пробіли у рядку на підкреслення.