# Напишіть функцію, що приймає число і повертає його квадрат.
# Створіть функцію з двома параметрами, яка повертає їх суму.
# Напишіть функцію з трьома параметрами, демонструючи виклик з ключовими словами.
# Визначте функцію з параметром за замовчуванням та продемонструйте виклик зі значенням за замовчуванням і без нього.
# Напишіть функцію, що приймає список чисел і повертає їх середнє значення.
# Створіть функцію, що приймає рядок як аргумент і повертає кількість слів у рядку.
# Напишіть функцію для визначення, чи є число простим.
# Створіть функцію, яка приймає невизначену кількість аргументів і повертає їх суму.
# Напишіть функцію, що повертає найбільше і найменше число зі списку.
# Реалізуйте функцію, що перевіряє, чи містить рядок задане слово.