# Надрукуйте "Привіт, світ!" у консолі.
# Створіть змінні для зберігання вашого імені та віку, а потім надрукуйте їх.
# Виконайте базові арифметичні операції (додавання, віднімання, множення, ділення) та надрукуйте результати.

# Продемонструйте використання різних типів даних: рядок, ціле число, дрібне число та булевий тип.
# Порівняйте два числа та виведіть результат порівняння.
# Запитайте у користувача його вік і виведіть, скільки йому буде років через 5 років.
# Запишіть рядок у зворотному порядку та виведіть його.
# Виведіть всі парні числа від 1 до 20.
# Знайдіть залишок від ділення двох чисел без використання оператора залишку.
# Створіть константу зі значенням вашого улюбленого числа і виведіть її.

print("Привіт, світ!")
name="Oleg"
age=38
print(name,age)

a=10
b=5
print(a+b)
print(a-b)
print(a*b)
print(a**b)
print(a/b)
print(a//b)


# Продемонструйте використання різних типів даних: рядок, ціле число, дрібне число та булевий тип.

a = "Hello"
b = 5
c = 5.5
d = True or False
c = 5.5
o = [1,2,3,4,5]
t = (1,2,3,4,5)

# перетворіть список в кортеж
# перетворіть кортеж в список
# перетворіть список в рядок
# Перетворіть список в множину 
# Порівняйте два числа та виведіть результат порівняння.




a = 100
a = float(a)


mylist =[o] 
mylist= tuple(mylist)

mylist= set(mylist)

a=5
b=7
print(a==b)
print(a!=b)
print(a<b)
print(a>b)

# name = input("Enter your name: ")

# Запитайте у користувача його вік і виведіть, скільки йому буде років через 5 років.
name = int(input("Введіть ваш вік: "))
# Введіть ваш вік: 38 

print(name + 5)

text = 'Hello world'

print(reversed(text))
print(text[::-1])

print(text.upper())


# int()
# float()
# str()
# bool()
# list()
# tuple()
# set()
# dict()


print(True or False)
print(1 or 0)



# Виведіть всі парні числа від 1 до 20.

for i in range (20+1):
    if i % 2 == 0:
        print(i)
        
g = []

for i in reversed(range(1, 11)):
    g.append(i)
print(g)


# Створіть константу зі значенням вашого улюбленого числа і виведіть її.
CONSTANT=28
print(CONSTANT)
