# Надрукуйте "Привіт, світ!" у консолі.
# Створіть змінні для зберігання вашого імені та віку, а потім надрукуйте їх.
# Виконайте базові арифметичні операції (додавання, віднімання, множення, ділення) та надрукуйте результати.
# Продемонструйте використання різних типів даних: рядок, ціле число, дрібне число та булевий тип.
# Порівняйте два числа та виведіть результат порівняння.
# Запитайте у користувача його вік і виведіть, скільки йому буде років через 5 років.
# Запишіть рядок у зворотному порядку та виведіть його.
# Виведіть всі парні числа від 1 до 20.
# Знайдіть залишок від ділення двох чисел без використання оператора залишку.
# Створіть константу зі значенням вашого улюбленого числа і виведіть її.


print("Привіт, світ ")

n = "Олександр"
m = 45
print(n, m)

a = 5
b = 3
print(a +b)
print(a - b)
print(a * b)
print(a / b)

a = str(a)
a = int(a)
a = float(a)
a = bool(a)

print(a == b)

your_age = int(input("Скільки вам років"))
age = your_age + 5
print(f"Через 5 років вам буде {your_age} років")


my_string = "Привіт всім"
print(my_string[::-1])


# c = [1,2,3,4 ]

for i in range(0, 21):
    if i % 2 == 0:
        print(i)

V = "Олександр"
print(V)




