# Надрукуйте "Привіт, світ!" у консолі.

print("Привіт, світ!")

# Створіть змінні для зберігання вашого імені та віку, а потім надрукуйте їх.

Name = 'Andriy'

Age = 29

print (Name, Age)

# Виконайте базові арифметичні операції (додавання, віднімання, множення, ділення) та надрукуйте результати.

print( 20 + 10 - 10 * 2 / 2)

# Продемонструйте використання різних типів даних: рядок, ціле число, дрібне число та булевий тип.

a = 'Text' 

b = 12

c = 10.2

d = True

# Порівняйте два числа та виведіть результат порівняння.

print(5 == 4)

# Запитайте у користувача його вік і виведіть, скільки йому буде років через 5 років.

def age_plus_5 ():
    your_age = input('скільки вам років?')
    print(int(your_age) + 5)

age_plus_5()


# Запишіть рядок у зворотному порядку та виведіть його.

text = 'Some text'
print(reversed(text)) # ::-1


# Виведіть всі парні числа від 1 до 20.

for i in range(20+1):
    if i % 2==0:
        print( i )

# Знайдіть залишок від ділення двох чисел без використання оператора залишку.


# Створіть константу зі значенням вашого улюбленого числа і виведіть її.

MY_FAVORITE_NUMBER = 13

print(MY_FAVORITE_NUMBER)