# Напишіть програму, яка перевіряє, чи є число позитивним чи негативним.

from tabnanny import check


def check_number(number: int):
   
    if number >0:
        print('Число позитивне')
    elif number < 0:
        print('Число негативне')
        


# check_number(5)




# Розширте попередню програму, додавши перевірку, чи є число нулем, позитивним чи негативним.

def check_number(number: int):
   
    if number >0:
        print('Число позитивне')
    elif number < 0:
        print('Число негативне')
    else:
        print('Число нейтральне')

# Напишіть цикл for для друку чисел від 1 до 10.

print(i for i in range(10 +1))

# Реалізуйте цикл while для знаходження суми чисел від 1 до 10.

# counter = sum([i for i in range(1,11)])
counter = 0

for i in range (1, 11): # 1,2,3,4,5,6,7,8,9,10
    while i < 11:
        counter += i
        break

print(counter)




# Використовуйте цикл for для створення рядка, що складається з парних чисел від 2 до 20.

for i in range(2, 21):
    if i % 2==0:
        print( i )


# Напишіть програму з використанням циклу while, яка буде запитувати у користувача числа до тих пір, поки не буде введено 0.

while True:
    number = int(input('Введіть число: '))
    if number == 0:
        break


# Реалізуйте цикл for для друку таблиці множення для числа 5.

for i in range(1, 11):
    print(f'5 * {i} = {5 * i}')
    

# Напишіть програму, яка використовує вкладені цикли для друку прямокутника з зірочок заданого розміру.

for i in range(5):
    for j in range(5):
        print('*', end='')
    print()
    
    
    
# Створіть програму, яка використовує if-else для визначення, чи є рік високосним.

year = int(input('Введіть рік'))

if year % 4 == 0 and year % 100 != 0 and year % 400 != 0:
    print('Рік високосним')
    else:



# Використовуйте цикл для обчислення факторіалу числа.


# : кожен рік, який ділиться на чотири, є високосним, за винятком років, які діляться на 100, але не діляться на 400.