# Надрукуйте "Привіт, світ!" у консолі.
# Створіть змінні для зберігання вашого імені та віку, а потім надрукуйте їх.
# Виконайте базові арифметичні операції (додавання, віднімання, множення, ділення) та надрукуйте результати.
# Продемонструйте використання різних типів даних: рядок, ціле число, дрібне число та булевий тип.
# Порівняйте два числа та виведіть результат порівняння.
# апитайте у користувача його вік і виведіть, скільки йому буде років через 5 років.З
# Запишіть рядок у зворотному порядку та виведіть його.
# Виведіть всі парні числа від 1 до 20.
# Знайдіть залишок від ділення двох чисел без використання оператора залишку.
# Створіть константу зі значенням вашого улюбленого числа і виведіть її.

print('Привіт, світ!')

name = 'Volodymyr'
age = 53
print(name)
print(age)




a = 4
b = 8
print(a + b)
print(b - a)
print(a * b)
print(b // a)

integer = 40
print(integer)
string = 'Hello'
print('Hello')
Float = 5.5
print(Float)
bool = True

a = 4
b = 7
result = a < b
print(result) 

age = 35
age_fut = age + 5
print(age_fut)

mystring = 'Hello world'
print(mystring[::-1])

for i in range (2, 21, 2):
    print(i)
    
CONST = 55
print(CONST)




  




# []