# Продемонструйте різницю між локальною та глобальною областю видимості змінних.
# Напишіть функцію з документаційним рядком, що пояснює, що робить функція, її параметри та повернене значення.
# Створіть лямбда-функцію, що обчислює площу прямокутника.
# Використовуйте map для перетворення температур з Цельсія в Фаренгейти, і filter для відкидання від'ємних чисел зі списку.
# Напишіть рекурсивну функцію для обчислення факторіалу числа.
# Створіть функцію, що приймає два рядки як аргументи та повертає True, якщо вони є анаграмами один одного.
# Напишіть функцію, яка приймає список чисел і повертає список тільки з унікальними елементами.
# Реалізуйте функцію, що повертає список всіх дільників заданого числа.
# Створіть функцію для обчислення квадратного кореня числа без використання вбудованої функції sqrt().
# Напишіть функцію, що приймає список слів і повертає слово з найбільшою кількістю голосних.